STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251fxx_ca35.h
/***************  Bit definition for CA35SSC_BRM0_RW register  ****************/
#define CA35SSC_BRM_RW_BRM_RATEVAL_Pos                           (0U)
#define CA35SSC_BRM_RW_BRM_RATEVAL_Msk                           (0x1UL << CA35SSC_BRM_RW_BRM_RATEVAL_Pos)              /*!< 0x00000001 */
#define CA35SSC_BRM_RW_BRM_RATEVAL                               CA35SSC_BRM_RW_BRM_RATEVAL_Msk                        /*!<  */
#define CA35SSC_BRM_RW_BRM_RATEACK_Pos                           (1U)
#define CA35SSC_BRM_RW_BRM_RATEACK_Msk                           (0x1UL << CA35SSC_BRM_RW_BRM_RATEACK_Pos)              /*!< 0x00000002 */
#define CA35SSC_BRM_RW_BRM_RATEACK                               CA35SSC_BRM_RW_BRM_RATEACK_Msk                        /*!<  */
#define CA35SSC_BRM_RW_BRM_RATE_Pos                              (8U)
#define CA35SSC_BRM_RW_BRM_RATE_Msk                              (0x3FUL << CA35SSC_BRM_RW_BRM_RATE_Pos)                /*!< 0x00003F00 */
#define CA35SSC_BRM_RW_BRM_RATE                                  CA35SSC_BRM_RW_BRM_RATE_Msk                           /*!< BRM rate in normal or idle mode when BRM_IDLEDIVEN =0 */
#define CA35SSC_BRM_RW_BRM_IDLEDIVEN_Pos                         (16U)
#define CA35SSC_BRM_RW_BRM_IDLEDIVEN_Msk                         (0x1UL << CA35SSC_BRM_RW_BRM_IDLEDIVEN_Pos)            /*!< 0x00010000 */
#define CA35SSC_BRM_RW_BRM_IDLEDIVEN                             CA35SSC_BRM_RW_BRM_IDLEDIVEN_Msk                      /*!<  */
#define CA35SSC_BRM_RW_BRM_IDLEDIV_Pos                           (24U)
#define CA35SSC_BRM_RW_BRM_IDLEDIV_Msk                           (0x3UL << CA35SSC_BRM_RW_BRM_IDLEDIV_Pos)              /*!< 0x03000000 */
#define CA35SSC_BRM_RW_BRM_IDLEDIV                               CA35SSC_BRM_RW_BRM_IDLEDIV_Msk                        /*!< Defines BRM rate when idle mode is entered */

/***************  Bit definition for CA35SSC_BRM_WS1 register  ****************/
#define CA35SSC_BRM_WS1_BRM_RATEVAL_Pos                          (0U)
#define CA35SSC_BRM_WS1_BRM_RATEVAL_Msk                          (0x1UL << CA35SSC_BRM_WS1_BRM_RATEVAL_Pos)             /*!< 0x00000001 */
#define CA35SSC_BRM_WS1_BRM_RATEVAL                              CA35SSC_BRM_WS1_BRM_RATEVAL_Msk                       /*!<  */
#define CA35SSC_BRM_WS1_BRM_RATEACK_Pos                          (1U)
#define CA35SSC_BRM_WS1_BRM_RATEACK_Msk                          (0x1UL << CA35SSC_BRM_WS1_BRM_RATEACK_Pos)             /*!< 0x00000002 */
#define CA35SSC_BRM_WS1_BRM_RATEACK                              CA35SSC_BRM_WS1_BRM_RATEACK_Msk                       /*!<  */
#define CA35SSC_BRM_WS1_BRM_RATE_Pos                             (8U)
#define CA35SSC_BRM_WS1_BRM_RATE_Msk                             (0x3FUL << CA35SSC_BRM_WS1_BRM_RATE_Pos)               /*!< 0x00003F00 */
#define CA35SSC_BRM_WS1_BRM_RATE                                 CA35SSC_BRM_WS1_BRM_RATE_Msk                          /*!< BRM rate in normal or idle mode when BRM_IDLEDIVEN =0 */
#define CA35SSC_BRM_WS1_BRM_IDLEDIVEN_Pos                        (16U)
#define CA35SSC_BRM_WS1_BRM_IDLEDIVEN_Msk                        (0x1UL << CA35SSC_BRM_WS1_BRM_IDLEDIVEN_Pos)           /*!< 0x00010000 */
#define CA35SSC_BRM_WS1_BRM_IDLEDIVEN                            CA35SSC_BRM_WS1_BRM_IDLEDIVEN_Msk                     /*!<  */
#define CA35SSC_BRM_WS1_BRM_IDLEDIV_Pos                          (24U)
#define CA35SSC_BRM_WS1_BRM_IDLEDIV_Msk                          (0x3UL << CA35SSC_BRM_WS1_BRM_IDLEDIV_Pos)             /*!< 0x03000000 */
#define CA35SSC_BRM_WS1_BRM_IDLEDIV                              CA35SSC_BRM_WS1_BRM_IDLEDIV_Msk                       /*!< Defines BRM rate when idle mode is entered */

/***************  Bit definition for CA35SSC_BRM_WC1 register  ****************/
#define CA35SSC_BRM_WC1_BRM_RATEVAL_Pos                          (0U)
#define CA35SSC_BRM_WC1_BRM_RATEVAL_Msk                          (0x1UL << CA35SSC_BRM_WC1_BRM_RATEVAL_Pos)             /*!< 0x00000001 */
#define CA35SSC_BRM_WC1_BRM_RATEVAL                              CA35SSC_BRM_WC1_BRM_RATEVAL_Msk                       /*!<  */
#define CA35SSC_BRM_WC1_BRM_RATEACK_Pos                          (1U)
#define CA35SSC_BRM_WC1_BRM_RATEACK_Msk                          (0x1UL << CA35SSC_BRM_WC1_BRM_RATEACK_Pos)             /*!< 0x00000002 */
#define CA35SSC_BRM_WC1_BRM_RATEACK                              CA35SSC_BRM_WC1_BRM_RATEACK_Msk                       /*!<  */
#define CA35SSC_BRM_WC1_BRM_RATE_Pos                             (8U)
#define CA35SSC_BRM_WC1_BRM_RATE_Msk                             (0x3FUL << CA35SSC_BRM_WC1_BRM_RATE_Pos)               /*!< 0x00003F00 */
#define CA35SSC_BRM_WC1_BRM_RATE                                 CA35SSC_BRM_WC1_BRM_RATE_Msk                          /*!< BRM rate in normal or idle mode when BRM_IDLEDIVEN =0 */
#define CA35SSC_BRM_WC1_BRM_IDLEDIVEN_Pos                        (16U)
#define CA35SSC_BRM_WC1_BRM_IDLEDIVEN_Msk                        (0x1UL << CA35SSC_BRM_WC1_BRM_IDLEDIVEN_Pos)           /*!< 0x00010000 */
#define CA35SSC_BRM_WC1_BRM_IDLEDIVEN                            CA35SSC_BRM_WC1_BRM_IDLEDIVEN_Msk                     /*!<  */
#define CA35SSC_BRM_WC1_BRM_IDLEDIV_Pos                          (24U)
#define CA35SSC_BRM_WC1_BRM_IDLEDIV_Msk                          (0x3UL << CA35SSC_BRM_WC1_BRM_IDLEDIV_Pos)             /*!< 0x03000000 */
#define CA35SSC_BRM_WC1_BRM_IDLEDIV                              CA35SSC_BRM_WC1_BRM_IDLEDIV_Msk                       /*!< Defines BRM rate when idle mode is entered */

/***************  Bit definition for CA35SSC_BRM_WT1 register  ****************/
#define CA35SSC_BRM_WT1_BRM_RATEVAL_Pos                          (0U)
#define CA35SSC_BRM_WT1_BRM_RATEVAL_Msk                          (0x1UL << CA35SSC_BRM_WT1_BRM_RATEVAL_Pos)             /*!< 0x00000001 */
#define CA35SSC_BRM_WT1_BRM_RATEVAL                              CA35SSC_BRM_WT1_BRM_RATEVAL_Msk                       /*!<  */
#define CA35SSC_BRM_WT1_BRM_RATEACK_Pos                          (1U)
#define CA35SSC_BRM_WT1_BRM_RATEACK_Msk                          (0x1UL << CA35SSC_BRM_WT1_BRM_RATEACK_Pos)             /*!< 0x00000002 */
#define CA35SSC_BRM_WT1_BRM_RATEACK                              CA35SSC_BRM_WT1_BRM_RATEACK_Msk                       /*!<  */
#define CA35SSC_BRM_WT1_BRM_RATE_Pos                             (8U)
#define CA35SSC_BRM_WT1_BRM_RATE_Msk                             (0x3FUL << CA35SSC_BRM_WT1_BRM_RATE_Pos)               /*!< 0x00003F00 */
#define CA35SSC_BRM_WT1_BRM_RATE                                 CA35SSC_BRM_WT1_BRM_RATE_Msk                          /*!< BRM rate in normal or idle mode when BRM_IDLEDIVEN =0 */
#define CA35SSC_BRM_WT1_BRM_IDLEDIVEN_Pos                        (16U)
#define CA35SSC_BRM_WT1_BRM_IDLEDIVEN_Msk                        (0x1UL << CA35SSC_BRM_WT1_BRM_IDLEDIVEN_Pos)           /*!< 0x00010000 */
#define CA35SSC_BRM_WT1_BRM_IDLEDIVEN                            CA35SSC_BRM_WT1_BRM_IDLEDIVEN_Msk                     /*!<  */
#define CA35SSC_BRM_WT1_BRM_IDLEDIV_Pos                          (24U)
#define CA35SSC_BRM_WT1_BRM_IDLEDIV_Msk                          (0x3UL << CA35SSC_BRM_WT1_BRM_IDLEDIV_Pos)             /*!< 0x03000000 */
#define CA35SSC_BRM_WT1_BRM_IDLEDIV                              CA35SSC_BRM_WT1_BRM_IDLEDIV_Msk                       /*!< Defines BRM rate when idle mode is entered */

/************  Bit definition for CA35SSC_PLL_FREQ1_RW register  ************/
#define CA35SSC_PLL_FREQ1_RW_FBDIV_Pos                           (0U)
#define CA35SSC_PLL_FREQ1_RW_FBDIV_Msk                           (0xFFFUL << CA35SSC_PLL_FREQ1_RW_FBDIV_Pos)            /*!< 0x00000FFF */
#define CA35SSC_PLL_FREQ1_RW_FBDIV                               CA35SSC_PLL_FREQ1_RW_FBDIV_Msk                        /*!< Feedback divide value */
#define CA35SSC_PLL_FREQ1_RW_REFDIV_Pos                          (16U)
#define CA35SSC_PLL_FREQ1_RW_REFDIV_Msk                          (0x3FUL << CA35SSC_PLL_FREQ1_RW_REFDIV_Pos)            /*!< 0x003F0000 */
#define CA35SSC_PLL_FREQ1_RW_REFDIV                              CA35SSC_PLL_FREQ1_RW_REFDIV_Msk                       /*!< Reference divide value */

/************  Bit definition for CA35SSC_PLL_FREQ1_WS1 register  ************/
#define CA35SSC_PLL_FREQ1_WS1_FBDIV_Pos                          (0U)
#define CA35SSC_PLL_FREQ1_WS1_FBDIV_Msk                          (0xFFFUL << CA35SSC_PLL_FREQ1_WS1_FBDIV_Pos)           /*!< 0x00000FFF */
#define CA35SSC_PLL_FREQ1_WS1_FBDIV                              CA35SSC_PLL_FREQ1_WS1_FBDIV_Msk                       /*!< Feedback divide value */
#define CA35SSC_PLL_FREQ1_WS1_REFDIV_Pos                         (16U)
#define CA35SSC_PLL_FREQ1_WS1_REFDIV_Msk                         (0x3FUL << CA35SSC_PLL_FREQ1_WS1_REFDIV_Pos)           /*!< 0x003F0000 */
#define CA35SSC_PLL_FREQ1_WS1_REFDIV                             CA35SSC_PLL_FREQ1_WS1_REFDIV_Msk                      /*!< Reference divide value */

/************  Bit definition for CA35SSC_PLL_FREQ1_WC1 register  ************/
#define CA35SSC_PLL_FREQ1_WC1_FBDIV_Pos                          (0U)
#define CA35SSC_PLL_FREQ1_WC1_FBDIV_Msk                          (0xFFFUL << CA35SSC_PLL_FREQ1_WC1_FBDIV_Pos)           /*!< 0x00000FFF */
#define CA35SSC_PLL_FREQ1_WC1_FBDIV                              CA35SSC_PLL_FREQ1_WC1_FBDIV_Msk                       /*!< Feedback divide value */
#define CA35SSC_PLL_FREQ1_WC1_REFDIV_Pos                         (16U)
#define CA35SSC_PLL_FREQ1_WC1_REFDIV_Msk                         (0x3FUL << CA35SSC_PLL_FREQ1_WC1_REFDIV_Pos)           /*!< 0x003F0000 */
#define CA35SSC_PLL_FREQ1_WC1_REFDIV                             CA35SSC_PLL_FREQ1_WC1_REFDIV_Msk                      /*!< Reference divide value */

/************  Bit definition for CA35SSC_PLL_FREQ1_WT1 register  ************/
#define CA35SSC_PLL_FREQ1_WT1_FBDIV_Pos                          (0U)
#define CA35SSC_PLL_FREQ1_WT1_FBDIV_Msk                          (0xFFFUL << CA35SSC_PLL_FREQ1_WT1_FBDIV_Pos)           /*!< 0x00000FFF */
#define CA35SSC_PLL_FREQ1_WT1_FBDIV                              CA35SSC_PLL_FREQ1_WT1_FBDIV_Msk                       /*!< Feedback divide value */
#define CA35SSC_PLL_FREQ1_WT1_REFDIV_Pos                         (16U)
#define CA35SSC_PLL_FREQ1_WT1_REFDIV_Msk                         (0x3FUL << CA35SSC_PLL_FREQ1_WT1_REFDIV_Pos)           /*!< 0x003F0000 */
#define CA35SSC_PLL_FREQ1_WT1_REFDIV                             CA35SSC_PLL_FREQ1_WT1_REFDIV_Msk                      /*!< Reference divide value */

/************  Bit definition for CA35SSC_PLL_FREQ2_RW register  ************/
#define CA35SSC_PLL_FREQ2_RW_POSTDIV1_Pos                        (0U)
#define CA35SSC_PLL_FREQ2_RW_POSTDIV1_Msk                        (0x7UL << CA35SSC_PLL_FREQ2_RW_POSTDIV1_Pos)           /*!< 0x00000007 */
#define CA35SSC_PLL_FREQ2_RW_POSTDIV1                            CA35SSC_PLL_FREQ2_RW_POSTDIV1_Msk                     /*!< PLL post divide 1 setting (1 to 7), POSTDIV1 = 0 is unused */
#define CA35SSC_PLL_FREQ2_RW_POSTDIV2_Pos                        (3U)
#define CA35SSC_PLL_FREQ2_RW_POSTDIV2_Msk                        (0x7UL << CA35SSC_PLL_FREQ2_RW_POSTDIV2_Pos)           /*!< 0x00000038 */
#define CA35SSC_PLL_FREQ2_RW_POSTDIV2                            CA35SSC_PLL_FREQ2_RW_POSTDIV2_Msk                     /*!< PLL post divide 2 setting (1 to 7), POSTDIV2 = 0 is unused */

/************  Bit definition for CA35SSC_PLL_FREQ2_WS1 register  ************/
#define CA35SSC_PLL_FREQ2_WS1_POSTDIV1_Pos                       (0U)
#define CA35SSC_PLL_FREQ2_WS1_POSTDIV1_Msk                       (0x7UL << CA35SSC_PLL_FREQ2_WS1_POSTDIV1_Pos)          /*!< 0x00000007 */
#define CA35SSC_PLL_FREQ2_WS1_POSTDIV1                           CA35SSC_PLL_FREQ2_WS1_POSTDIV1_Msk                    /*!< PLL post divide 1 setting (1 to 7), POSTDIV1 = 0 is unused */
#define CA35SSC_PLL_FREQ2_WS1_POSTDIV2_Pos                       (3U)
#define CA35SSC_PLL_FREQ2_WS1_POSTDIV2_Msk                       (0x7UL << CA35SSC_PLL_FREQ2_WS1_POSTDIV2_Pos)          /*!< 0x00000038 */
#define CA35SSC_PLL_FREQ2_WS1_POSTDIV2                           CA35SSC_PLL_FREQ2_WS1_POSTDIV2_Msk                    /*!< PLL post divide 2 setting (1 to 7), POSTDIV2 = 0 is unused */

/************  Bit definition for CA35SSC_PLL_FREQ2_WC1 register  ************/
#define CA35SSC_PLL_FREQ2_WC1_POSTDIV1_Pos                       (0U)
#define CA35SSC_PLL_FREQ2_WC1_POSTDIV1_Msk                       (0x7UL << CA35SSC_PLL_FREQ2_WC1_POSTDIV1_Pos)          /*!< 0x00000007 */
#define CA35SSC_PLL_FREQ2_WC1_POSTDIV1                           CA35SSC_PLL_FREQ2_WC1_POSTDIV1_Msk                    /*!< PLL post divide 1 setting (1 to 7), POSTDIV1 = 0 is unused */
#define CA35SSC_PLL_FREQ2_WC1_POSTDIV2_Pos                       (3U)
#define CA35SSC_PLL_FREQ2_WC1_POSTDIV2_Msk                       (0x7UL << CA35SSC_PLL_FREQ2_WC1_POSTDIV2_Pos)          /*!< 0x00000038 */
#define CA35SSC_PLL_FREQ2_WC1_POSTDIV2                           CA35SSC_PLL_FREQ2_WC1_POSTDIV2_Msk                    /*!< PLL post divide 2 setting (1 to 7), POSTDIV2 = 0 is unused */

/************  Bit definition for CA35SSC_PLL_FREQ2_WT1 register  ************/
#define CA35SSC_PLL_FREQ2_WT1_POSTDIV1_Pos                       (0U)
#define CA35SSC_PLL_FREQ2_WT1_POSTDIV1_Msk                       (0x7UL << CA35SSC_PLL_FREQ2_WT1_POSTDIV1_Pos)          /*!< 0x00000007 */
#define CA35SSC_PLL_FREQ2_WT1_POSTDIV1                           CA35SSC_PLL_FREQ2_WT1_POSTDIV1_Msk                    /*!< PLL post divide 1 setting (1 to 7), POSTDIV1 = 0 is unused */
#define CA35SSC_PLL_FREQ2_WT1_POSTDIV2_Pos                       (3U)
#define CA35SSC_PLL_FREQ2_WT1_POSTDIV2_Msk                       (0x7UL << CA35SSC_PLL_FREQ2_WT1_POSTDIV2_Pos)          /*!< 0x00000038 */
#define CA35SSC_PLL_FREQ2_WT1_POSTDIV2                           CA35SSC_PLL_FREQ2_WT1_POSTDIV2_Msk                    /*!< PLL post divide 2 setting (1 to 7), POSTDIV2 = 0 is unused */

/************  Bit definition for CA35SSC_PLL_ENABLE_RW register  ************/
#define CA35SSC_PLL_ENABLE_RW_PLL_EN_Pos                         (0U)
#define CA35SSC_PLL_ENABLE_RW_PLL_EN_Msk                         (0x1UL << CA35SSC_PLL_ENABLE_RW_PLL_EN_Pos)            /*!< 0x00000001 */
#define CA35SSC_PLL_ENABLE_RW_PLL_EN                             CA35SSC_PLL_ENABLE_RW_PLL_EN_Msk                      /*!<  */
#define CA35SSC_PLL_ENABLE_RW_LOCKP_Pos                          (1U)
#define CA35SSC_PLL_ENABLE_RW_LOCKP_Msk                          (0x1UL << CA35SSC_PLL_ENABLE_RW_LOCKP_Pos)             /*!< 0x00000002 */
#define CA35SSC_PLL_ENABLE_RW_LOCKP                              CA35SSC_PLL_ENABLE_RW_LOCKP_Msk                       /*!<  */
#define CA35SSC_PLL_ENABLE_RW_NRESET_SWPLL_Pos                   (2U)
#define CA35SSC_PLL_ENABLE_RW_NRESET_SWPLL_Msk                   (0x1UL << CA35SSC_PLL_ENABLE_RW_NRESET_SWPLL_Pos)      /*!< 0x00000004 */
#define CA35SSC_PLL_ENABLE_RW_NRESET_SWPLL                       CA35SSC_PLL_ENABLE_RW_NRESET_SWPLL_Msk                /*!<  */
#define CA35SSC_PLL_ENABLE_RW_EN_PLL_OBS_Pos                     (31U)
#define CA35SSC_PLL_ENABLE_RW_EN_PLL_OBS_Msk                     (0x1UL << CA35SSC_PLL_ENABLE_RW_EN_PLL_OBS_Pos)        /*!< 0x80000000 */
#define CA35SSC_PLL_ENABLE_RW_EN_PLL_OBS                         CA35SSC_PLL_ENABLE_RW_EN_PLL_OBS_Msk                  /*!<  */

