STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251fxx_ca35.h
/*******************  Bit definition for I3C_SER register  ********************/
#define I3C_SER_CODERR_Pos           (0U)
#define I3C_SER_CODERR_Msk           (0xFUL << I3C_SER_CODERR_Pos)          /*!< 0x0000000F */
#define I3C_SER_CODERR               I3C_SER_CODERR_Msk                    /*!< protocol error code/type */
#define I3C_SER_CODERR_0             (0x1UL << I3C_SER_CODERR_Pos)         /*!< 0x00000001 */
#define I3C_SER_CODERR_1             (0x2UL << I3C_SER_CODERR_Pos)         /*!< 0x00000002 */
#define I3C_SER_CODERR_2             (0x4UL << I3C_SER_CODERR_Pos)         /*!< 0x00000004 */
#define I3C_SER_CODERR_3             (0x8UL << I3C_SER_CODERR_Pos)         /*!< 0x00000008 */
#define I3C_SER_PERR_Pos             (4U)
#define I3C_SER_PERR_Msk             (0x1UL << I3C_SER_PERR_Pos)            /*!< 0x00000010 */
#define I3C_SER_PERR                 I3C_SER_PERR_Msk                      /*!< protocol error */
#define I3C_SER_STALL_Pos            (5U)
#define I3C_SER_STALL_Msk            (0x1UL << I3C_SER_STALL_Pos)           /*!< 0x00000020 */
#define I3C_SER_STALL                I3C_SER_STALL_Msk                     /*!< SCL stall error (when the I3C is acting as target) */
#define I3C_SER_DOVR_Pos             (6U)
#define I3C_SER_DOVR_Msk             (0x1UL << I3C_SER_DOVR_Pos)            /*!< 0x00000040 */
#define I3C_SER_DOVR                 I3C_SER_DOVR_Msk                      /*!< RX-FIFO overrun or TX-FIFO underrun */
#define I3C_SER_COVR_Pos             (7U)
#define I3C_SER_COVR_Msk             (0x1UL << I3C_SER_COVR_Pos)            /*!< 0x00000080 */
#define I3C_SER_COVR                 I3C_SER_COVR_Msk                      /*!< C-FIFO underrun or S-FIFO overrun (when the I3C is acting as controller) */
#define I3C_SER_ANACK_Pos            (8U)
#define I3C_SER_ANACK_Msk            (0x1UL << I3C_SER_ANACK_Pos)           /*!< 0x00000100 */
#define I3C_SER_ANACK                I3C_SER_ANACK_Msk                     /*!< address not acknowledged (when the I3C is configured as controller) */
#define I3C_SER_DNACK_Pos            (9U)
#define I3C_SER_DNACK_Msk            (0x1UL << I3C_SER_DNACK_Pos)           /*!< 0x00000200 */
#define I3C_SER_DNACK                I3C_SER_DNACK_Msk                     /*!< data not acknowledged (when the I3C is acting as controller) */
#define I3C_SER_DERR_Pos             (10U)
#define I3C_SER_DERR_Msk             (0x1UL << I3C_SER_DERR_Pos)            /*!< 0x00000400 */
#define I3C_SER_DERR                 I3C_SER_DERR_Msk                      /*!< data error (when the I3C is acting as controller) */

/*******************  Bit definition for I3C_RMR register  ********************/
#define I3C_RMR_IBIRDCNT_Pos         (0U)
#define I3C_RMR_IBIRDCNT_Msk         (0x7UL << I3C_RMR_IBIRDCNT_Pos)        /*!< 0x00000007 */
#define I3C_RMR_IBIRDCNT             I3C_RMR_IBIRDCNT_Msk                  /*!< IBI received payload data count (when the I3C is configured as controller) */
#define I3C_RMR_RCODE_Pos            (8U)
#define I3C_RMR_RCODE_Msk            (0xFFUL << I3C_RMR_RCODE_Pos)          /*!< 0x0000FF00 */
#define I3C_RMR_RCODE                I3C_RMR_RCODE_Msk                     /*!< received CCC code (when the I3C is configured as target) */
#define I3C_RMR_RADD_Pos             (17U)
#define I3C_RMR_RADD_Msk             (0x7FUL << I3C_RMR_RADD_Pos)           /*!< 0x00FE0000 */
#define I3C_RMR_RADD                 I3C_RMR_RADD_Msk                      /*!< received target address (when the I3C is configured as controller) */

/*******************  Bit definition for I3C_EVR register  ********************/
#define I3C_EVR_CFEF_Pos             (0U)
#define I3C_EVR_CFEF_Msk             (0x1UL << I3C_EVR_CFEF_Pos)            /*!< 0x00000001 */
#define I3C_EVR_CFEF                 I3C_EVR_CFEF_Msk                      /*!< C-FIFO empty flag (whatever the I3C is acting as controller/target) */
#define I3C_EVR_TXFEF_Pos            (1U)
#define I3C_EVR_TXFEF_Msk            (0x1UL << I3C_EVR_TXFEF_Pos)           /*!< 0x00000002 */
#define I3C_EVR_TXFEF                I3C_EVR_TXFEF_Msk                     /*!< TX-FIFO empty flag (whatever the I3C is acting as controller/target) */
#define I3C_EVR_CFNFF_Pos            (2U)
#define I3C_EVR_CFNFF_Msk            (0x1UL << I3C_EVR_CFNFF_Pos)           /*!< 0x00000004 */
#define I3C_EVR_CFNFF                I3C_EVR_CFNFF_Msk                     /*!< C-FIFO not full flag (when the I3C is acting as controller) */
#define I3C_EVR_SFNEF_Pos            (3U)
#define I3C_EVR_SFNEF_Msk            (0x1UL << I3C_EVR_SFNEF_Pos)           /*!< 0x00000008 */
#define I3C_EVR_SFNEF                I3C_EVR_SFNEF_Msk                     /*!< S-FIFO not empty flag (when the I3C is acting as controller) */
#define I3C_EVR_TXFNFF_Pos           (4U)
#define I3C_EVR_TXFNFF_Msk           (0x1UL << I3C_EVR_TXFNFF_Pos)          /*!< 0x00000010 */
#define I3C_EVR_TXFNFF               I3C_EVR_TXFNFF_Msk                    /*!< TX-FIFO not full flag (whatever the I3C is acting as controller/target) */
#define I3C_EVR_RXFNEF_Pos           (5U)
#define I3C_EVR_RXFNEF_Msk           (0x1UL << I3C_EVR_RXFNEF_Pos)          /*!< 0x00000020 */
#define I3C_EVR_RXFNEF               I3C_EVR_RXFNEF_Msk                    /*!< RX-FIFO not empty flag (whatever the I3C is acting as controller/target) */
#define I3C_EVR_TXLASTF_Pos          (6U)
#define I3C_EVR_TXLASTF_Msk          (0x1UL << I3C_EVR_TXLASTF_Pos)         /*!< 0x00000040 */
#define I3C_EVR_TXLASTF              I3C_EVR_TXLASTF_Msk                   /*!< last written data byte/word flag (whatever the I3C is acting as controller/target) */
#define I3C_EVR_RXLASTF_Pos          (7U)
#define I3C_EVR_RXLASTF_Msk          (0x1UL << I3C_EVR_RXLASTF_Pos)         /*!< 0x00000080 */
#define I3C_EVR_RXLASTF              I3C_EVR_RXLASTF_Msk                   /*!< last read data byte/word flag (whatever the I3C is acting as controller/target) */
#define I3C_EVR_FCF_Pos              (9U)
#define I3C_EVR_FCF_Msk              (0x1UL << I3C_EVR_FCF_Pos)             /*!< 0x00000200 */
#define I3C_EVR_FCF                  I3C_EVR_FCF_Msk                       /*!< frame complete flag (whatever the I3C is acting as controller/target) */
#define I3C_EVR_RXTGTENDF_Pos        (10U)
#define I3C_EVR_RXTGTENDF_Msk        (0x1UL << I3C_EVR_RXTGTENDF_Pos)       /*!< 0x00000400 */
#define I3C_EVR_RXTGTENDF            I3C_EVR_RXTGTENDF_Msk                 /*!< target-initiated read end flag (when the I3C is acting as controller) */
#define I3C_EVR_ERRF_Pos             (11U)
#define I3C_EVR_ERRF_Msk             (0x1UL << I3C_EVR_ERRF_Pos)            /*!< 0x00000800 */
#define I3C_EVR_ERRF                 I3C_EVR_ERRF_Msk                      /*!< flag (whatever the I3C is acting as controller/target) */
#define I3C_EVR_IBIF_Pos             (15U)
#define I3C_EVR_IBIF_Msk             (0x1UL << I3C_EVR_IBIF_Pos)            /*!< 0x00008000 */
#define I3C_EVR_IBIF                 I3C_EVR_IBIF_Msk                      /*!< IBI flag (when the I3C is acting as controller) */
#define I3C_EVR_IBIENDF_Pos          (16U)
#define I3C_EVR_IBIENDF_Msk          (0x1UL << I3C_EVR_IBIENDF_Pos)         /*!< 0x00010000 */
#define I3C_EVR_IBIENDF              I3C_EVR_IBIENDF_Msk                   /*!< IBI end flag (when the I3C is acting as target) */
#define I3C_EVR_CRF_Pos              (17U)
#define I3C_EVR_CRF_Msk              (0x1UL << I3C_EVR_CRF_Pos)             /*!< 0x00020000 */
#define I3C_EVR_CRF                  I3C_EVR_CRF_Msk                       /*!< controller-role request flag (when the I3C is acting as controller) */
#define I3C_EVR_CRUPDF_Pos           (18U)
#define I3C_EVR_CRUPDF_Msk           (0x1UL << I3C_EVR_CRUPDF_Pos)          /*!< 0x00040000 */
#define I3C_EVR_CRUPDF               I3C_EVR_CRUPDF_Msk                    /*!< controller-role update flag (when the I3C is acting as target) */
#define I3C_EVR_HJF_Pos              (19U)
#define I3C_EVR_HJF_Msk              (0x1UL << I3C_EVR_HJF_Pos)             /*!< 0x00080000 */
#define I3C_EVR_HJF                  I3C_EVR_HJF_Msk                       /*!< hot-join flag (when the I3C is acting as controller) */
#define I3C_EVR_WKPF_Pos             (21U)
#define I3C_EVR_WKPF_Msk             (0x1UL << I3C_EVR_WKPF_Pos)            /*!< 0x00200000 */
#define I3C_EVR_WKPF                 I3C_EVR_WKPF_Msk                      /*!< wakeup/missed start flag (when the I3C is acting as target) */
#define I3C_EVR_GETF_Pos             (22U)
#define I3C_EVR_GETF_Msk             (0x1UL << I3C_EVR_GETF_Pos)            /*!< 0x00400000 */
#define I3C_EVR_GETF                 I3C_EVR_GETF_Msk                      /*!< get flag (when the I3C is acting as target) */
#define I3C_EVR_STAF_Pos             (23U)
#define I3C_EVR_STAF_Msk             (0x1UL << I3C_EVR_STAF_Pos)            /*!< 0x00800000 */
#define I3C_EVR_STAF                 I3C_EVR_STAF_Msk                      /*!< get status flag (when the I3C is acting as target) */
#define I3C_EVR_DAUPDF_Pos           (24U)
#define I3C_EVR_DAUPDF_Msk           (0x1UL << I3C_EVR_DAUPDF_Pos)          /*!< 0x01000000 */
#define I3C_EVR_DAUPDF               I3C_EVR_DAUPDF_Msk                    /*!< dynamic address update flag (when the I3C is acting as target) */
#define I3C_EVR_MWLUPDF_Pos          (25U)
#define I3C_EVR_MWLUPDF_Msk          (0x1UL << I3C_EVR_MWLUPDF_Pos)         /*!< 0x02000000 */
#define I3C_EVR_MWLUPDF              I3C_EVR_MWLUPDF_Msk                   /*!< maximum write length update flag (when the I3C is acting as target) */
#define I3C_EVR_MRLUPDF_Pos          (26U)
#define I3C_EVR_MRLUPDF_Msk          (0x1UL << I3C_EVR_MRLUPDF_Pos)         /*!< 0x04000000 */
#define I3C_EVR_MRLUPDF              I3C_EVR_MRLUPDF_Msk                   /*!< maximum read length update flag (when the I3C is acting as target) */
#define I3C_EVR_RSTF_Pos             (27U)
#define I3C_EVR_RSTF_Msk             (0x1UL << I3C_EVR_RSTF_Pos)            /*!< 0x08000000 */
#define I3C_EVR_RSTF                 I3C_EVR_RSTF_Msk                      /*!< reset pattern flag (when the I3C is acting as target) */
#define I3C_EVR_ASUPDF_Pos           (28U)
#define I3C_EVR_ASUPDF_Msk           (0x1UL << I3C_EVR_ASUPDF_Pos)          /*!< 0x10000000 */
#define I3C_EVR_ASUPDF               I3C_EVR_ASUPDF_Msk                    /*!< activity state update flag (when the I3C is acting as target) */
#define I3C_EVR_INTUPDF_Pos          (29U)
#define I3C_EVR_INTUPDF_Msk          (0x1UL << I3C_EVR_INTUPDF_Pos)         /*!< 0x20000000 */
#define I3C_EVR_INTUPDF              I3C_EVR_INTUPDF_Msk                   /*!< interrupt/controller-role/hot-join update flag (when the I3C is acting as target) */
#define I3C_EVR_DEFF_Pos             (30U)
#define I3C_EVR_DEFF_Msk             (0x1UL << I3C_EVR_DEFF_Pos)            /*!< 0x40000000 */
#define I3C_EVR_DEFF                 I3C_EVR_DEFF_Msk                      /*!< DEFTGTS flag (when the I3C is acting as target) */
#define I3C_EVR_GRPF_Pos             (31U)
#define I3C_EVR_GRPF_Msk             (0x1UL << I3C_EVR_GRPF_Pos)            /*!< 0x80000000 */
#define I3C_EVR_GRPF                 I3C_EVR_GRPF_Msk                      /*!< group addressing flag (when the I3C is acting as target) */

/*******************  Bit definition for I3C_IER register  ********************/
#define I3C_IER_CFNFIE_Pos           (2U)
#define I3C_IER_CFNFIE_Msk           (0x1UL << I3C_IER_CFNFIE_Pos)          /*!< 0x00000004 */
#define I3C_IER_CFNFIE               I3C_IER_CFNFIE_Msk                    /*!< C-FIFO not full interrupt enable (whatever the I3C is acting as controller/target) */
#define I3C_IER_SFNEIE_Pos           (3U)
#define I3C_IER_SFNEIE_Msk           (0x1UL << I3C_IER_SFNEIE_Pos)          /*!< 0x00000008 */
#define I3C_IER_SFNEIE               I3C_IER_SFNEIE_Msk                    /*!< S-FIFO not empty interrupt enable (whatever the I3C is acting as controller/target) */
#define I3C_IER_TXFNFIE_Pos          (4U)
#define I3C_IER_TXFNFIE_Msk          (0x1UL << I3C_IER_TXFNFIE_Pos)         /*!< 0x00000010 */
#define I3C_IER_TXFNFIE              I3C_IER_TXFNFIE_Msk                   /*!< TX-FIFO not full interrupt enable (whatever the I3C is acting as controller/target) */
#define I3C_IER_RXFNEIE_Pos          (5U)
#define I3C_IER_RXFNEIE_Msk          (0x1UL << I3C_IER_RXFNEIE_Pos)         /*!< 0x00000020 */
#define I3C_IER_RXFNEIE              I3C_IER_RXFNEIE_Msk                   /*!< RX-FIFO not empty interrupt enable (whatever the I3C is acting as controller/target) */
#define I3C_IER_FCIE_Pos             (9U)
#define I3C_IER_FCIE_Msk             (0x1UL << I3C_IER_FCIE_Pos)            /*!< 0x00000200 */
#define I3C_IER_FCIE                 I3C_IER_FCIE_Msk                      /*!< frame complete interrupt enable (whatever the I3C is acting as controller/target) */
#define I3C_IER_RXTGTENDIE_Pos       (10U)
#define I3C_IER_RXTGTENDIE_Msk       (0x1UL << I3C_IER_RXTGTENDIE_Pos)      /*!< 0x00000400 */
#define I3C_IER_RXTGTENDIE           I3C_IER_RXTGTENDIE_Msk                /*!< target-initiated read end interrupt enable (when the I3C is acting as controller) */
#define I3C_IER_ERRIE_Pos            (11U)
#define I3C_IER_ERRIE_Msk            (0x1UL << I3C_IER_ERRIE_Pos)           /*!< 0x00000800 */
#define I3C_IER_ERRIE                I3C_IER_ERRIE_Msk                     /*!< error interrupt enable (whatever the I3C is acting as controller/target) */
#define I3C_IER_IBIIE_Pos            (15U)
#define I3C_IER_IBIIE_Msk            (0x1UL << I3C_IER_IBIIE_Pos)           /*!< 0x00008000 */
#define I3C_IER_IBIIE                I3C_IER_IBIIE_Msk                     /*!< IBI request interrupt enable (when the I3C is acting as controller) */
#define I3C_IER_IBIENDIE_Pos         (16U)
#define I3C_IER_IBIENDIE_Msk         (0x1UL << I3C_IER_IBIENDIE_Pos)        /*!< 0x00010000 */
#define I3C_IER_IBIENDIE             I3C_IER_IBIENDIE_Msk                  /*!< IBI end interrupt enable (when the I3C is acting as target) */
#define I3C_IER_CRIE_Pos             (17U)
#define I3C_IER_CRIE_Msk             (0x1UL << I3C_IER_CRIE_Pos)            /*!< 0x00020000 */
#define I3C_IER_CRIE                 I3C_IER_CRIE_Msk                      /*!< controller-role request interrupt enable (when the I3C is acting as controller) */
#define I3C_IER_CRUPDIE_Pos          (18U)
#define I3C_IER_CRUPDIE_Msk          (0x1UL << I3C_IER_CRUPDIE_Pos)         /*!< 0x00040000 */
#define I3C_IER_CRUPDIE              I3C_IER_CRUPDIE_Msk                   /*!< controller-role update interrupt enable (when the I3C is acting as target) */
#define I3C_IER_HJIE_Pos             (19U)
#define I3C_IER_HJIE_Msk             (0x1UL << I3C_IER_HJIE_Pos)            /*!< 0x00080000 */
#define I3C_IER_HJIE                 I3C_IER_HJIE_Msk                      /*!< hot-join interrupt enable (when the I3C is acting as controller) */
#define I3C_IER_WKPIE_Pos            (21U)
#define I3C_IER_WKPIE_Msk            (0x1UL << I3C_IER_WKPIE_Pos)           /*!< 0x00200000 */
#define I3C_IER_WKPIE                I3C_IER_WKPIE_Msk                     /*!< wakeup interrupt enable (when the I3C is acting as target) */
#define I3C_IER_GETIE_Pos            (22U)
#define I3C_IER_GETIE_Msk            (0x1UL << I3C_IER_GETIE_Pos)           /*!< 0x00400000 */
#define I3C_IER_GETIE                I3C_IER_GETIE_Msk                     /*!< GETxxx CCC interrupt enable (when the I3C is acting as target) */
#define I3C_IER_STAIE_Pos            (23U)
#define I3C_IER_STAIE_Msk            (0x1UL << I3C_IER_STAIE_Pos)           /*!< 0x00800000 */
#define I3C_IER_STAIE                I3C_IER_STAIE_Msk                     /*!< GETSTATUS CCC interrupt enable (when the I3C is acting as target) */
#define I3C_IER_DAUPDIE_Pos          (24U)
#define I3C_IER_DAUPDIE_Msk          (0x1UL << I3C_IER_DAUPDIE_Pos)         /*!< 0x01000000 */
#define I3C_IER_DAUPDIE              I3C_IER_DAUPDIE_Msk                   /*!< ENTDAA/RSTDAA/SETNEWDA CCC interrupt enable (when the I3C is acting as target) */
#define I3C_IER_MWLUPDIE_Pos         (25U)
#define I3C_IER_MWLUPDIE_Msk         (0x1UL << I3C_IER_MWLUPDIE_Pos)        /*!< 0x02000000 */
#define I3C_IER_MWLUPDIE             I3C_IER_MWLUPDIE_Msk                  /*!< SETMWL CCC interrupt enable (when the I3C is acting as target) */
#define I3C_IER_MRLUPDIE_Pos         (26U)
#define I3C_IER_MRLUPDIE_Msk         (0x1UL << I3C_IER_MRLUPDIE_Pos)        /*!< 0x04000000 */
#define I3C_IER_MRLUPDIE             I3C_IER_MRLUPDIE_Msk                  /*!< SETMRL CCC interrupt enable (when the I3C is acting as target) */
#define I3C_IER_RSTIE_Pos            (27U)
#define I3C_IER_RSTIE_Msk            (0x1UL << I3C_IER_RSTIE_Pos)           /*!< 0x08000000 */
#define I3C_IER_RSTIE                I3C_IER_RSTIE_Msk                     /*!< reset pattern interrupt enable (when the I3C is acting as target) */
#define I3C_IER_ASUPDIE_Pos          (28U)
#define I3C_IER_ASUPDIE_Msk          (0x1UL << I3C_IER_ASUPDIE_Pos)         /*!< 0x10000000 */
#define I3C_IER_ASUPDIE              I3C_IER_ASUPDIE_Msk                   /*!< ENTASx CCC interrupt enable (when the I3C is acting as target) */
#define I3C_IER_INTUPDIE_Pos         (29U)
#define I3C_IER_INTUPDIE_Msk         (0x1UL << I3C_IER_INTUPDIE_Pos)        /*!< 0x20000000 */
#define I3C_IER_INTUPDIE             I3C_IER_INTUPDIE_Msk                  /*!< ENEC/DISEC CCC interrupt enable (when the I3C is acting as target) */
#define I3C_IER_DEFIE_Pos            (30U)
#define I3C_IER_DEFIE_Msk            (0x1UL << I3C_IER_DEFIE_Pos)           /*!< 0x40000000 */
#define I3C_IER_DEFIE                I3C_IER_DEFIE_Msk                     /*!< DEFTGTS CCC interrupt enable (when the I3C is acting as target) */
#define I3C_IER_GRPIE_Pos            (31U)
#define I3C_IER_GRPIE_Msk            (0x1UL << I3C_IER_GRPIE_Pos)           /*!< 0x80000000 */
#define I3C_IER_GRPIE                I3C_IER_GRPIE_Msk                     /*!< DEFGRPA CCC interrupt enable (when the I3C is acting as target) */

/*******************  Bit definition for I3C_CEVR register  *******************/
#define I3C_CEVR_CFCF_Pos            (9U)
#define I3C_CEVR_CFCF_Msk            (0x1UL << I3C_CEVR_CFCF_Pos)           /*!< 0x00000200 */
#define I3C_CEVR_CFCF                I3C_CEVR_CFCF_Msk                     /*!< clear frame complete flag (whatever the I3C is acting as controller/target) */
#define I3C_CEVR_CRXTGTENDF_Pos      (10U)
#define I3C_CEVR_CRXTGTENDF_Msk      (0x1UL << I3C_CEVR_CRXTGTENDF_Pos)     /*!< 0x00000400 */
#define I3C_CEVR_CRXTGTENDF          I3C_CEVR_CRXTGTENDF_Msk               /*!< clear target-initiated read end flag (when the I3C is acting as controller) */
#define I3C_CEVR_CERRF_Pos           (11U)
#define I3C_CEVR_CERRF_Msk           (0x1UL << I3C_CEVR_CERRF_Pos)          /*!< 0x00000800 */
#define I3C_CEVR_CERRF               I3C_CEVR_CERRF_Msk                    /*!< clear error flag (whatever the I3C is acting as controller/target) */
#define I3C_CEVR_CIBIF_Pos           (15U)
#define I3C_CEVR_CIBIF_Msk           (0x1UL << I3C_CEVR_CIBIF_Pos)          /*!< 0x00008000 */
#define I3C_CEVR_CIBIF               I3C_CEVR_CIBIF_Msk                    /*!< clear IBI request flag (when the I3C is acting as controller) */
#define I3C_CEVR_CIBIENDF_Pos        (16U)
#define I3C_CEVR_CIBIENDF_Msk        (0x1UL << I3C_CEVR_CIBIENDF_Pos)       /*!< 0x00010000 */
#define I3C_CEVR_CIBIENDF            I3C_CEVR_CIBIENDF_Msk                 /*!< clear IBI end flag (when the I3C is acting as target) */
#define I3C_CEVR_CCRF_Pos            (17U)
#define I3C_CEVR_CCRF_Msk            (0x1UL << I3C_CEVR_CCRF_Pos)           /*!< 0x00020000 */
#define I3C_CEVR_CCRF                I3C_CEVR_CCRF_Msk                     /*!< clear controller-role request flag (when the I3C is acting as controller) */
#define I3C_CEVR_CCRUPDF_Pos         (18U)
#define I3C_CEVR_CCRUPDF_Msk         (0x1UL << I3C_CEVR_CCRUPDF_Pos)        /*!< 0x00040000 */
#define I3C_CEVR_CCRUPDF             I3C_CEVR_CCRUPDF_Msk                  /*!< clear controller-role update flag (when the I3C is acting as target) */
#define I3C_CEVR_CHJF_Pos            (19U)
#define I3C_CEVR_CHJF_Msk            (0x1UL << I3C_CEVR_CHJF_Pos)           /*!< 0x00080000 */
#define I3C_CEVR_CHJF                I3C_CEVR_CHJF_Msk                     /*!< clear hot-join flag (when the I3C is acting as controller) */
#define I3C_CEVR_CWKPF_Pos           (21U)
#define I3C_CEVR_CWKPF_Msk           (0x1UL << I3C_CEVR_CWKPF_Pos)          /*!< 0x00200000 */
#define I3C_CEVR_CWKPF               I3C_CEVR_CWKPF_Msk                    /*!< clear wakeup flag (when the I3C is acting as target) */
#define I3C_CEVR_CGETF_Pos           (22U)
#define I3C_CEVR_CGETF_Msk           (0x1UL << I3C_CEVR_CGETF_Pos)          /*!< 0x00400000 */
#define I3C_CEVR_CGETF               I3C_CEVR_CGETF_Msk                    /*!< clear GETxxx CCC flag (when the I3C is acting as target) */
#define I3C_CEVR_CSTAF_Pos           (23U)
#define I3C_CEVR_CSTAF_Msk           (0x1UL << I3C_CEVR_CSTAF_Pos)          /*!< 0x00800000 */
#define I3C_CEVR_CSTAF               I3C_CEVR_CSTAF_Msk                    /*!< clear GETSTATUS CCC flag (when the I3C is acting as target) */
#define I3C_CEVR_CDAUPDF_Pos         (24U)
#define I3C_CEVR_CDAUPDF_Msk         (0x1UL << I3C_CEVR_CDAUPDF_Pos)        /*!< 0x01000000 */
#define I3C_CEVR_CDAUPDF             I3C_CEVR_CDAUPDF_Msk                  /*!< clear ENTDAA/RSTDAA/SETNEWDA CCC flag (when the I3C is acting as target) */
#define I3C_CEVR_CMWLUPDF_Pos        (25U)
#define I3C_CEVR_CMWLUPDF_Msk        (0x1UL << I3C_CEVR_CMWLUPDF_Pos)       /*!< 0x02000000 */
#define I3C_CEVR_CMWLUPDF            I3C_CEVR_CMWLUPDF_Msk                 /*!< clear SETMWL CCC flag (when the I3C is acting as target) */
#define I3C_CEVR_CMRLUPDF_Pos        (26U)
#define I3C_CEVR_CMRLUPDF_Msk        (0x1UL << I3C_CEVR_CMRLUPDF_Pos)       /*!< 0x04000000 */
#define I3C_CEVR_CMRLUPDF            I3C_CEVR_CMRLUPDF_Msk                 /*!< clear SETMRL CCC flag (when the I3C is acting as target) */
#define I3C_CEVR_CRSTF_Pos           (27U)
#define I3C_CEVR_CRSTF_Msk           (0x1UL << I3C_CEVR_CRSTF_Pos)          /*!< 0x08000000 */
#define I3C_CEVR_CRSTF               I3C_CEVR_CRSTF_Msk                    /*!< clear reset pattern flag (when the I3C is acting as target) */
#define I3C_CEVR_CASUPDF_Pos         (28U)
#define I3C_CEVR_CASUPDF_Msk         (0x1UL << I3C_CEVR_CASUPDF_Pos)        /*!< 0x10000000 */
#define I3C_CEVR_CASUPDF             I3C_CEVR_CASUPDF_Msk                  /*!< clear ENTASx CCC flag (when the I3C is acting as target) */
#define I3C_CEVR_CINTUPDF_Pos        (29U)
#define I3C_CEVR_CINTUPDF_Msk        (0x1UL << I3C_CEVR_CINTUPDF_Pos)       /*!< 0x20000000 */
#define I3C_CEVR_CINTUPDF            I3C_CEVR_CINTUPDF_Msk                 /*!< clear ENEC/DISEC CCC flag (when the I3C is acting as target) */
#define I3C_CEVR_CDEFF_Pos           (30U)
#define I3C_CEVR_CDEFF_Msk           (0x1UL << I3C_CEVR_CDEFF_Pos)          /*!< 0x40000000 */
#define I3C_CEVR_CDEFF               I3C_CEVR_CDEFF_Msk                    /*!< clear DEFTGTS CCC flag (when the I3C is acting as target) */
#define I3C_CEVR_CGRPF_Pos           (31U)
#define I3C_CEVR_CGRPF_Msk           (0x1UL << I3C_CEVR_CGRPF_Pos)          /*!< 0x80000000 */
#define I3C_CEVR_CGRPF               I3C_CEVR_CGRPF_Msk                    /*!< clear DEFGRPA CCC flag (when the I3C is acting as target) */

