STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251fxx_ca35.h
#define RISAB_IAESR_IASEC_Pos         (5U)
#define RISAB_IAESR_IASEC_Msk         (0x1UL << RISAB_IAESR_IASEC_Pos)           /*!< 0x00000020 */
#define RISAB_IAESR_IASEC             RISAB_IAESR_IASEC_Msk

#define RISAB_IAESR_IANRW_Pos         (7U)
#define RISAB_IAESR_IANRW_Msk         (0x1UL << RISAB_IAESR_IANRW_Pos)           /*!< 0x00000080 */
#define RISAB_IAESR_IANRW             RISAB_IAESR_IANRW_Msk

/*******************  Bits definition for RISAB_IADDR register ****************/
#define RISAB_IADDR_IADD_Pos          (0U)
#define RISAB_IADDR_IADD_Msk          (0xFFFFFFFFUL << RISAB_IADDR_IADD_Pos)     /*!< 0xFFFFFFFF */
#define RISAB_IADDR_IADD              RISAB_IADDR_IADD_Msk

/*******************  Bits definition for RISAB_PGx_SECCFGR register **********/
#define RISAB_PGSECCFGR_SEC_Pos       (0U)
#define RISAB_PGSECCFGR_SEC_Msk       (0xFFUL << RISAB_PGSECCFGR_SEC_Pos)        /*!< 0x000000FF */
#define RISAB_PGSECCFGR_SEC           RISAB_PGSECCFGR_SEC_Msk
#define RISAB_PGSECCFGR_SEC0_Pos      (0U)
#define RISAB_PGSECCFGR_SEC0_Msk      (0x1UL << RISAB_PGSECCFGR_SEC0_Pos)        /*!< 0x00000001 */
#define RISAB_PGSECCFGR_SEC0          RISAB_PGSECCFGR_SEC0_Msk
#define RISAB_PGSECCFGR_SEC1_Pos      (1U)
#define RISAB_PGSECCFGR_SEC1_Msk      (0x1UL << RISAB_PGSECCFGR_SEC1_Pos)        /*!< 0x00000002 */
#define RISAB_PGSECCFGR_SEC1          RISAB_PGSECCFGR_SEC1_Msk
#define RISAB_PGSECCFGR_SEC2_Pos      (2U)
#define RISAB_PGSECCFGR_SEC2_Msk      (0x1UL << RISAB_PGSECCFGR_SEC2_Pos)        /*!< 0x00000004 */
#define RISAB_PGSECCFGR_SEC2          RISAB_PGSECCFGR_SEC2_Msk
#define RISAB_PGSECCFGR_SEC3_Pos      (3U)
#define RISAB_PGSECCFGR_SEC3_Msk      (0x1UL << RISAB_PGSECCFGR_SEC3_Pos)        /*!< 0x00000008 */
#define RISAB_PGSECCFGR_SEC3          RISAB_PGSECCFGR_SEC3_Msk
#define RISAB_PGSECCFGR_SEC4_Pos      (4U)
#define RISAB_PGSECCFGR_SEC4_Msk      (0x1UL << RISAB_PGSECCFGR_SEC4_Pos)        /*!< 0x00000010 */
#define RISAB_PGSECCFGR_SEC4          RISAB_PGSECCFGR_SEC4_Msk
#define RISAB_PGSECCFGR_SEC5_Pos      (5U)
#define RISAB_PGSECCFGR_SEC5_Msk      (0x1UL << RISAB_PGSECCFGR_SEC5_Pos)        /*!< 0x00000020 */
#define RISAB_PGSECCFGR_SEC5          RISAB_PGSECCFGR_SEC5_Msk
#define RISAB_PGSECCFGR_SEC6_Pos      (6U)
#define RISAB_PGSECCFGR_SEC6_Msk      (0x1UL << RISAB_PGSECCFGR_SEC6_Pos)        /*!< 0x00000040 */
#define RISAB_PGSECCFGR_SEC6          RISAB_PGSECCFGR_SEC6_Msk
#define RISAB_PGSECCFGR_SEC7_Pos      (7U)
#define RISAB_PGSECCFGR_SEC7_Msk      (0x1UL << RISAB_PGSECCFGR_SEC7_Pos)        /*!< 0x00000080 */
#define RISAB_PGSECCFGR_SEC7          RISAB_PGSECCFGR_SEC7_Msk

/*******************  Bits definition for RISAB_PGx_PRIVCFGR register *********/
#define RISAB_PGPRIVCFGR_PRIV_Pos     (0U)
#define RISAB_PGPRIVCFGR_PRIV_Msk     (0xFFUL << RISAB_PGPRIVCFGR_PRIV_Pos)      /*!< 0x000000FF */
#define RISAB_PGPRIVCFGR_PRIV         RISAB_PGPRIVCFGR_PRIV_Msk
#define RISAB_PGPRIVCFGR_PRIV0_Pos    (0U)
#define RISAB_PGPRIVCFGR_PRIV0_Msk    (0x1UL << RISAB_PGPRIVCFGR_PRIV0_Pos)      /*!< 0x00000001 */
#define RISAB_PGPRIVCFGR_PRIV0        RISAB_PGPRIVCFGR_PRIV0_Msk
#define RISAB_PGPRIVCFGR_PRIV1_Pos    (1U)
#define RISAB_PGPRIVCFGR_PRIV1_Msk    (0x1UL << RISAB_PGPRIVCFGR_PRIV1_Pos)      /*!< 0x00000002 */
#define RISAB_PGPRIVCFGR_PRIV1        RISAB_PGPRIVCFGR_PRIV1_Msk
#define RISAB_PGPRIVCFGR_PRIV2_Pos    (2U)
#define RISAB_PGPRIVCFGR_PRIV2_Msk    (0x1UL << RISAB_PGPRIVCFGR_PRIV2_Pos)      /*!< 0x00000004 */
#define RISAB_PGPRIVCFGR_PRIV2        RISAB_PGPRIVCFGR_PRIV2_Msk
#define RISAB_PGPRIVCFGR_PRIV3_Pos    (3U)
#define RISAB_PGPRIVCFGR_PRIV3_Msk    (0x1UL << RISAB_PGPRIVCFGR_PRIV3_Pos)      /*!< 0x00000008 */
#define RISAB_PGPRIVCFGR_PRIV3        RISAB_PGPRIVCFGR_PRIV3_Msk
#define RISAB_PGPRIVCFGR_PRIV4_Pos    (4U)
#define RISAB_PGPRIVCFGR_PRIV4_Msk    (0x1UL << RISAB_PGPRIVCFGR_PRIV4_Pos)      /*!< 0x00000010 */
#define RISAB_PGPRIVCFGR_PRIV4        RISAB_PGPRIVCFGR_PRIV4_Msk
#define RISAB_PGPRIVCFGR_PRIV5_Pos    (5U)
#define RISAB_PGPRIVCFGR_PRIV5_Msk    (0x1UL << RISAB_PGPRIVCFGR_PRIV5_Pos)      /*!< 0x00000020 */
#define RISAB_PGPRIVCFGR_PRIV5        RISAB_PGPRIVCFGR_PRIV5_Msk
#define RISAB_PGPRIVCFGR_PRIV6_Pos    (6U)
#define RISAB_PGPRIVCFGR_PRIV6_Msk    (0x1UL << RISAB_PGPRIVCFGR_PRIV6_Pos)      /*!< 0x00000040 */
#define RISAB_PGPRIVCFGR_PRIV6        RISAB_PGPRIVCFGR_PRIV6_Msk
#define RISAB_PGPRIVCFGR_PRIV7_Pos    (7U)
#define RISAB_PGPRIVCFGR_PRIV7_Msk    (0x1UL << RISAB_PGPRIVCFGR_PRIV7_Pos)      /*!< 0x00000080 */
#define RISAB_PGPRIVCFGR_PRIV7        RISAB_PGPRIVCFGR_PRIV7_Msk

/*******************  Bits definition for RISAB_PGx_C2PRIVCFGRx register ******/
#define RISAB_PGC2PRIVCFGR_PRIV_Pos   (0U)
#define RISAB_PGC2PRIVCFGR_PRIV_Msk   (0xFFUL << RISAB_PGC2PRIVCFGR_PRIV_Pos)    /*!< 0x000000FF */
#define RISAB_PGC2PRIVCFGR_PRIV       RISAB_PGC2PRIVCFGR_PRIV_Msk
#define RISAB_PGC2PRIVCFGR_PRIV0_Pos  (0U)
#define RISAB_PGC2PRIVCFGR_PRIV0_Msk  (0x1UL << RISAB_PGC2PRIVCFGR_PRIV0_Pos)    /*!< 0x00000001 */
#define RISAB_PGC2PRIVCFGR_PRIV0      RISAB_PGC2PRIVCFGR_PRIV0_Msk
#define RISAB_PGC2PRIVCFGR_PRIV1_Pos  (1U)
#define RISAB_PGC2PRIVCFGR_PRIV1_Msk  (0x1UL << RISAB_PGC2PRIVCFGR_PRIV1_Pos)    /*!< 0x00000002 */
#define RISAB_PGC2PRIVCFGR_PRIV1      RISAB_PGC2PRIVCFGR_PRIV1_Msk
#define RISAB_PGC2PRIVCFGR_PRIV2_Pos  (2U)
#define RISAB_PGC2PRIVCFGR_PRIV2_Msk  (0x1UL << RISAB_PGC2PRIVCFGR_PRIV2_Pos)    /*!< 0x00000004 */
#define RISAB_PGC2PRIVCFGR_PRIV2      RISAB_PGC2PRIVCFGR_PRIV2_Msk
#define RISAB_PGC2PRIVCFGR_PRIV3_Pos  (3U)
#define RISAB_PGC2PRIVCFGR_PRIV3_Msk  (0x1UL << RISAB_PGC2PRIVCFGR_PRIV3_Pos)    /*!< 0x00000008 */
#define RISAB_PGC2PRIVCFGR_PRIV3      RISAB_PGC2PRIVCFGR_PRIV3_Msk
#define RISAB_PGC2PRIVCFGR_PRIV4_Pos  (4U)
#define RISAB_PGC2PRIVCFGR_PRIV4_Msk  (0x1UL << RISAB_PGC2PRIVCFGR_PRIV4_Pos)    /*!< 0x00000010 */
#define RISAB_PGC2PRIVCFGR_PRIV4      RISAB_PGC2PRIVCFGR_PRIV4_Msk
#define RISAB_PGC2PRIVCFGR_PRIV5_Pos  (5U)
#define RISAB_PGC2PRIVCFGR_PRIV5_Msk  (0x1UL << RISAB_PGC2PRIVCFGR_PRIV5_Pos)    /*!< 0x00000020 */
#define RISAB_PGC2PRIVCFGR_PRIV5      RISAB_PGC2PRIVCFGR_PRIV5_Msk
#define RISAB_PGC2PRIVCFGR_PRIV6_Pos  (6U)
#define RISAB_PGC2PRIVCFGR_PRIV6_Msk  (0x1UL << RISAB_PGC2PRIVCFGR_PRIV6_Pos)    /*!< 0x00000040 */
#define RISAB_PGC2PRIVCFGR_PRIV6      RISAB_PGC2PRIVCFGR_PRIV6_Msk
#define RISAB_PGC2PRIVCFGR_PRIV7_Pos  (7U)
#define RISAB_PGC2PRIVCFGR_PRIV7_Msk  (0x1UL << RISAB_PGC2PRIVCFGR_PRIV7_Pos)    /*!< 0x00000080 */
#define RISAB_PGC2PRIVCFGR_PRIV7      RISAB_PGC2PRIVCFGR_PRIV7_Msk

/*******************  Bits definition for RISAB_CIDxPRIVCFGR register *********/
#define RISAB_CIDPRIVCFGR_PPRIV_Pos   (0U)
#define RISAB_CIDPRIVCFGR_PPRIV_Msk   (0xFFFFFFFFUL << RISAB_CIDPRIVCFGR_PPRIV_Pos)  /*!< 0xFFFFFFFF */
#define RISAB_CIDPRIVCFGR_PPRIV       RISAB_CIDPRIVCFGR_PPRIV_Msk
#define RISAB_CIDPRIVCFGR_PPRIV0_Pos  (0U)
#define RISAB_CIDPRIVCFGR_PPRIV0_Msk  (0x1UL << RISAB_CIDPRIVCFGR_PPRIV0_Pos)    /*!< 0x00000001 */
#define RISAB_CIDPRIVCFGR_PPRIV0      RISAB_CIDPRIVCFGR_PPRIV0_Msk
#define RISAB_CIDPRIVCFGR_PPRIV1_Pos  (1U)
#define RISAB_CIDPRIVCFGR_PPRIV1_Msk  (0x1UL << RISAB_CIDPRIVCFGR_PPRIV1_Pos)    /*!< 0x00000002 */
#define RISAB_CIDPRIVCFGR_PPRIV1      RISAB_CIDPRIVCFGR_PPRIV1_Msk
#define RISAB_CIDPRIVCFGR_PPRIV2_Pos  (2U)
#define RISAB_CIDPRIVCFGR_PPRIV2_Msk  (0x1UL << RISAB_CIDPRIVCFGR_PPRIV2_Pos)    /*!< 0x00000004 */
#define RISAB_CIDPRIVCFGR_PPRIV2      RISAB_CIDPRIVCFGR_PPRIV2_Msk
#define RISAB_CIDPRIVCFGR_PPRIV3_Pos  (3U)
#define RISAB_CIDPRIVCFGR_PPRIV3_Msk  (0x1UL << RISAB_CIDPRIVCFGR_PPRIV3_Pos)    /*!< 0x00000008 */
#define RISAB_CIDPRIVCFGR_PPRIV3      RISAB_CIDPRIVCFGR_PPRIV3_Msk
#define RISAB_CIDPRIVCFGR_PPRIV4_Pos  (4U)
#define RISAB_CIDPRIVCFGR_PPRIV4_Msk  (0x1UL << RISAB_CIDPRIVCFGR_PPRIV4_Pos)    /*!< 0x00000010 */
#define RISAB_CIDPRIVCFGR_PPRIV4      RISAB_CIDPRIVCFGR_PPRIV4_Msk
#define RISAB_CIDPRIVCFGR_PPRIV5_Pos  (5U)
#define RISAB_CIDPRIVCFGR_PPRIV5_Msk  (0x1UL << RISAB_CIDPRIVCFGR_PPRIV5_Pos)    /*!< 0x00000020 */
#define RISAB_CIDPRIVCFGR_PPRIV5      RISAB_CIDPRIVCFGR_PPRIV5_Msk
#define RISAB_CIDPRIVCFGR_PPRIV6_Pos  (6U)
#define RISAB_CIDPRIVCFGR_PPRIV6_Msk  (0x1UL << RISAB_CIDPRIVCFGR_PPRIV6_Pos)    /*!< 0x00000040 */
#define RISAB_CIDPRIVCFGR_PPRIV6      RISAB_CIDPRIVCFGR_PPRIV6_Msk
#define RISAB_CIDPRIVCFGR_PPRIV7_Pos  (7U)
#define RISAB_CIDPRIVCFGR_PPRIV7_Msk  (0x1UL << RISAB_CIDPRIVCFGR_PPRIV7_Pos)    /*!< 0x00000080 */
#define RISAB_CIDPRIVCFGR_PPRIV7      RISAB_CIDPRIVCFGR_PPRIV7_Msk
#define RISAB_CIDPRIVCFGR_PPRIV8_Pos  (8U)
#define RISAB_CIDPRIVCFGR_PPRIV8_Msk  (0x1UL << RISAB_CIDPRIVCFGR_PPRIV8_Pos)    /*!< 0x00000100 */
#define RISAB_CIDPRIVCFGR_PPRIV8      RISAB_CIDPRIVCFGR_PPRIV8_Msk
#define RISAB_CIDPRIVCFGR_PPRIV9_Pos  (9U)
#define RISAB_CIDPRIVCFGR_PPRIV9_Msk  (0x1UL << RISAB_CIDPRIVCFGR_PPRIV9_Pos)    /*!< 0x00000200 */
#define RISAB_CIDPRIVCFGR_PPRIV9      RISAB_CIDPRIVCFGR_PPRIV9_Msk
#define RISAB_CIDPRIVCFGR_PPRIV10_Pos (10U)
#define RISAB_CIDPRIVCFGR_PPRIV10_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV10_Pos)   /*!< 0x00000400 */
#define RISAB_CIDPRIVCFGR_PPRIV10     RISAB_CIDPRIVCFGR_PPRIV10_Msk
#define RISAB_CIDPRIVCFGR_PPRIV11_Pos (11U)
#define RISAB_CIDPRIVCFGR_PPRIV11_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV11_Pos)   /*!< 0x00000800 */
#define RISAB_CIDPRIVCFGR_PPRIV11     RISAB_CIDPRIVCFGR_PPRIV11_Msk
#define RISAB_CIDPRIVCFGR_PPRIV12_Pos (12U)
#define RISAB_CIDPRIVCFGR_PPRIV12_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV12_Pos)   /*!< 0x00001000 */
#define RISAB_CIDPRIVCFGR_PPRIV12     RISAB_CIDPRIVCFGR_PPRIV12_Msk
#define RISAB_CIDPRIVCFGR_PPRIV13_Pos (13U)
#define RISAB_CIDPRIVCFGR_PPRIV13_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV13_Pos)   /*!< 0x00002000 */
#define RISAB_CIDPRIVCFGR_PPRIV13     RISAB_CIDPRIVCFGR_PPRIV13_Msk
#define RISAB_CIDPRIVCFGR_PPRIV14_Pos (14U)
#define RISAB_CIDPRIVCFGR_PPRIV14_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV14_Pos)   /*!< 0x00004000 */
#define RISAB_CIDPRIVCFGR_PPRIV14     RISAB_CIDPRIVCFGR_PPRIV14_Msk
#define RISAB_CIDPRIVCFGR_PPRIV15_Pos (15U)
#define RISAB_CIDPRIVCFGR_PPRIV15_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV15_Pos)   /*!< 0x00008000 */
#define RISAB_CIDPRIVCFGR_PPRIV15     RISAB_CIDPRIVCFGR_PPRIV15_Msk
#define RISAB_CIDPRIVCFGR_PPRIV16_Pos (16U)
#define RISAB_CIDPRIVCFGR_PPRIV16_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV16_Pos)   /*!< 0x00010000 */
#define RISAB_CIDPRIVCFGR_PPRIV16     RISAB_CIDPRIVCFGR_PPRIV16_Msk
#define RISAB_CIDPRIVCFGR_PPRIV17_Pos (17U)
#define RISAB_CIDPRIVCFGR_PPRIV17_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV17_Pos)   /*!< 0x00020000 */
#define RISAB_CIDPRIVCFGR_PPRIV17     RISAB_CIDPRIVCFGR_PPRIV17_Msk
#define RISAB_CIDPRIVCFGR_PPRIV18_Pos (18U)
#define RISAB_CIDPRIVCFGR_PPRIV18_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV18_Pos)   /*!< 0x00040000 */
#define RISAB_CIDPRIVCFGR_PPRIV18     RISAB_CIDPRIVCFGR_PPRIV18_Msk
#define RISAB_CIDPRIVCFGR_PPRIV19_Pos (19U)
#define RISAB_CIDPRIVCFGR_PPRIV19_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV19_Pos)   /*!< 0x00080000 */
#define RISAB_CIDPRIVCFGR_PPRIV19     RISAB_CIDPRIVCFGR_PPRIV19_Msk
#define RISAB_CIDPRIVCFGR_PPRIV20_Pos (20U)
#define RISAB_CIDPRIVCFGR_PPRIV20_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV20_Pos)   /*!< 0x00100000 */
#define RISAB_CIDPRIVCFGR_PPRIV20     RISAB_CIDPRIVCFGR_PPRIV20_Msk
#define RISAB_CIDPRIVCFGR_PPRIV21_Pos (21U)
#define RISAB_CIDPRIVCFGR_PPRIV21_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV21_Pos)   /*!< 0x00200000 */
#define RISAB_CIDPRIVCFGR_PPRIV21     RISAB_CIDPRIVCFGR_PPRIV21_Msk
#define RISAB_CIDPRIVCFGR_PPRIV22_Pos (22U)
#define RISAB_CIDPRIVCFGR_PPRIV22_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV22_Pos)   /*!< 0x00400000 */
#define RISAB_CIDPRIVCFGR_PPRIV22     RISAB_CIDPRIVCFGR_PPRIV22_Msk
#define RISAB_CIDPRIVCFGR_PPRIV23_Pos (23U)
#define RISAB_CIDPRIVCFGR_PPRIV23_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV23_Pos)   /*!< 0x00800000 */
#define RISAB_CIDPRIVCFGR_PPRIV23     RISAB_CIDPRIVCFGR_PPRIV23_Msk
#define RISAB_CIDPRIVCFGR_PPRIV24_Pos (24U)
#define RISAB_CIDPRIVCFGR_PPRIV24_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV24_Pos)   /*!< 0x01000000 */
#define RISAB_CIDPRIVCFGR_PPRIV24     RISAB_CIDPRIVCFGR_PPRIV24_Msk
#define RISAB_CIDPRIVCFGR_PPRIV25_Pos (25U)
#define RISAB_CIDPRIVCFGR_PPRIV25_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV25_Pos)   /*!< 0x02000000 */
#define RISAB_CIDPRIVCFGR_PPRIV25     RISAB_CIDPRIVCFGR_PPRIV25_Msk
#define RISAB_CIDPRIVCFGR_PPRIV26_Pos (26U)
#define RISAB_CIDPRIVCFGR_PPRIV26_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV26_Pos)   /*!< 0x04000000 */
#define RISAB_CIDPRIVCFGR_PPRIV26     RISAB_CIDPRIVCFGR_PPRIV26_Msk
#define RISAB_CIDPRIVCFGR_PPRIV27_Pos (27U)
#define RISAB_CIDPRIVCFGR_PPRIV27_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV27_Pos)   /*!< 0x08000000 */
#define RISAB_CIDPRIVCFGR_PPRIV27     RISAB_CIDPRIVCFGR_PPRIV27_Msk
#define RISAB_CIDPRIVCFGR_PPRIV28_Pos (28U)
#define RISAB_CIDPRIVCFGR_PPRIV28_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV28_Pos)   /*!< 0x10000000 */
#define RISAB_CIDPRIVCFGR_PPRIV28     RISAB_CIDPRIVCFGR_PPRIV28_Msk
#define RISAB_CIDPRIVCFGR_PPRIV29_Pos (29U)
#define RISAB_CIDPRIVCFGR_PPRIV29_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV29_Pos)   /*!< 0x20000000 */
#define RISAB_CIDPRIVCFGR_PPRIV29     RISAB_CIDPRIVCFGR_PPRIV29_Msk
#define RISAB_CIDPRIVCFGR_PPRIV30_Pos (30U)
#define RISAB_CIDPRIVCFGR_PPRIV30_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV30_Pos)   /*!< 0x40000000 */
#define RISAB_CIDPRIVCFGR_PPRIV30     RISAB_CIDPRIVCFGR_PPRIV30_Msk
#define RISAB_CIDPRIVCFGR_PPRIV31_Pos (31U)
#define RISAB_CIDPRIVCFGR_PPRIV31_Msk (0x1UL << RISAB_CIDPRIVCFGR_PPRIV31_Pos)   /*!< 0x80000000 */
#define RISAB_CIDPRIVCFGR_PPRIV31     RISAB_CIDPRIVCFGR_PPRIV31_Msk

