STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251fxx_ca35.h
/****************  Bit definition for SYSCFG_ICNCGCR register  ****************/
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DDR_Pos                           (0U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DDR_Msk                           (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DDR_Pos)                             /*!< 0x00000001 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DDR                               SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DDR_Msk                                       /*!< When set to â1â, ICN automatic clock gating on clk_icn_ddr domain is OFF */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DISPLAY_Pos                       (1U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DISPLAY_Msk                       (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DISPLAY_Pos)                         /*!< 0x00000002 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DISPLAY                           SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DISPLAY_Msk                                   /*!< When set to â1â, ICN automatic clock gating on clk_icn_display domain is OFF */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_HSL_Pos                           (2U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_HSL_Msk                           (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_HSL_Pos)                             /*!< 0x00000004 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_HSL                               SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_HSL_Msk                                       /*!< When set to â1â, ICN automatic clock gating on clk_icn_hsl domain is OFF */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_MCU_Pos                           (3U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_MCU_Msk                           (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_MCU_Pos)                             /*!< 0x00000008 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_MCU                               SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_MCU_Msk                                       /*!< When set to â1â, ICN automatic clock gating on clk_icn_mcu domain is OFF */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SYSATB_Pos                        (4U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SYSATB_Msk                        (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SYSATB_Pos)                          /*!< 0x00000010 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SYSATB                            SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SYSATB_Msk                                    /*!< When set to â1â, ICN automatic clock gating on clk_icn_sysatb domain is OFF */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SDMMC_Pos                         (5U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SDMMC_Msk                         (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SDMMC_Pos)                           /*!< 0x00000020 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SDMMC                             SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SDMMC_Msk                                     /*!< When set to â1â, ICN automatic clock gating on clk_icn_sdmmc domain is OFF */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_BUSPERFM_Pos                      (6U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_BUSPERFM_Msk                      (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_BUSPERFM_Pos)                        /*!< 0x00000040 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_BUSPERFM                          SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_BUSPERFM_Msk                                  /*!< When set to â1â, ICN automatic clock gating on clk_icn_busperfm domain is OFF */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_VID_Pos                           (7U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_VID_Msk                           (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_VID_Pos)                             /*!< 0x00000080 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_VID                               SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_VID_Msk                                       /*!< When set to â1â, ICN automatic clock gating on clk_icn_vid domain is OFF */

/**************  Bit definition for SYSCFG_ICNGPUBWRCR register  **************/
#define SYSCFG_ICNGPUBWRCR_REGULATION_ENABLE_Pos                           (0U)
#define SYSCFG_ICNGPUBWRCR_REGULATION_ENABLE_Msk                           (0x1UL << SYSCFG_ICNGPUBWRCR_REGULATION_ENABLE_Pos)                             /*!< 0x00000001 */
#define SYSCFG_ICNGPUBWRCR_REGULATION_ENABLE                               SYSCFG_ICNGPUBWRCR_REGULATION_ENABLE_Msk                                       /*!< Activates the regulation part that allows a DDR-Saturation to temporarily block the GPU Transaction */
#define SYSCFG_ICNGPUBWRCR_READ_PACING_ENABLE_Pos                          (1U)
#define SYSCFG_ICNGPUBWRCR_READ_PACING_ENABLE_Msk                          (0x1UL << SYSCFG_ICNGPUBWRCR_READ_PACING_ENABLE_Pos)                            /*!< 0x00000002 */
#define SYSCFG_ICNGPUBWRCR_READ_PACING_ENABLE                              SYSCFG_ICNGPUBWRCR_READ_PACING_ENABLE_Msk                                      /*!< Activates the regulation part that paces the GPU Read Transactions at the rate they can be processe */
#define SYSCFG_ICNGPUBWRCR_RESTART_DELAY_Pos                               (2U)
#define SYSCFG_ICNGPUBWRCR_RESTART_DELAY_Msk                               (0x3UL << SYSCFG_ICNGPUBWRCR_RESTART_DELAY_Pos)                                 /*!< 0x0000000C */
#define SYSCFG_ICNGPUBWRCR_RESTART_DELAY                                   SYSCFG_ICNGPUBWRCR_RESTART_DELAY_Msk                                           /*!< Configures the delay applies before restarting GPU Transaction after they have been blocked by a DD */

/**************  Bit definition for SYSCFG_ICNE2EBWRCR register  **************/
#define SYSCFG_ICNE2EBWRCR_CFG_ENABLE_Pos                                  (0U)
#define SYSCFG_ICNE2EBWRCR_CFG_ENABLE_Msk                                  (0x1UL << SYSCFG_ICNE2EBWRCR_CFG_ENABLE_Pos)                                    /*!< 0x00000001 */
#define SYSCFG_ICNE2EBWRCR_CFG_ENABLE                                      SYSCFG_ICNE2EBWRCR_CFG_ENABLE_Msk                                              /*!< Activates the End-to-end Bandwidth Regulation of the SoC */
#define SYSCFG_ICNE2EBWRCR_CFG_MODEL_Pos                                   (1U)
#define SYSCFG_ICNE2EBWRCR_CFG_MODEL_Msk                                   (0x3UL << SYSCFG_ICNE2EBWRCR_CFG_MODEL_Pos)                                     /*!< 0x00000006 */
#define SYSCFG_ICNE2EBWRCR_CFG_MODEL                                       SYSCFG_ICNE2EBWRCR_CFG_MODEL_Msk                                               /*!< Defines the reactivity of the feedback of the Regulation */
#define SYSCFG_ICNE2EBWRCR_CFG_ALL_TGT_Pos                                 (4U)
#define SYSCFG_ICNE2EBWRCR_CFG_ALL_TGT_Msk                                 (0x7UL << SYSCFG_ICNE2EBWRCR_CFG_ALL_TGT_Pos)                                   /*!< 0x00000070 */
#define SYSCFG_ICNE2EBWRCR_CFG_ALL_TGT                                     SYSCFG_ICNE2EBWRCR_CFG_ALL_TGT_Msk                                             /*!< Defines the Amount of Empty CAM Slots (in the DDR-CTRL), that the Regulation targets */
#define SYSCFG_ICNE2EBWRCR_CFG_CPU1_BW_Pos                                 (8U)
#define SYSCFG_ICNE2EBWRCR_CFG_CPU1_BW_Msk                                 (0x1UL << SYSCFG_ICNE2EBWRCR_CFG_CPU1_BW_Pos)                                   /*!< 0x00000100 */
#define SYSCFG_ICNE2EBWRCR_CFG_CPU1_BW                                     SYSCFG_ICNE2EBWRCR_CFG_CPU1_BW_Msk                                             /*!< Allows to triple the Bandwidth allowed to the CPU1 by the Regulation */
#define SYSCFG_ICNE2EBWRCR_CFG_HPDMA_BW_Pos                                (9U)
#define SYSCFG_ICNE2EBWRCR_CFG_HPDMA_BW_Msk                                (0x1UL << SYSCFG_ICNE2EBWRCR_CFG_HPDMA_BW_Pos)                                  /*!< 0x00000200 */
#define SYSCFG_ICNE2EBWRCR_CFG_HPDMA_BW                                    SYSCFG_ICNE2EBWRCR_CFG_HPDMA_BW_Msk                                            /*!< Allows to triple the Bandwidth allowed to the HPDMA1/2/3 by the Regulation */

/***************  Bit definition for SYSCFG_SAFERSTCR register  ***************/
#define SYSCFG_SAFERSTCR_CFG_ENABLE_Pos                                    (0U)
#define SYSCFG_SAFERSTCR_CFG_ENABLE_Msk                                    (0x1UL << SYSCFG_SAFERSTCR_CFG_ENABLE_Pos)                                      /*!< 0x00000001 */
#define SYSCFG_SAFERSTCR_CFG_ENABLE                                        SYSCFG_SAFERSTCR_CFG_ENABLE_Msk                                                /*!< Activates Safe Reset connector of the SoC */

/**************  Bit definition for SYSCFG_USB2PHY1CR register  ***************/
#define SYSCFG_USB2PHY1CR_RETENABLEN1_Pos                                  (0U)
#define SYSCFG_USB2PHY1CR_RETENABLEN1_Msk                                  (0x1UL << SYSCFG_USB2PHY1CR_RETENABLEN1_Pos)                                    /*!< 0x00000001 */
#define SYSCFG_USB2PHY1CR_RETENABLEN1                                      SYSCFG_USB2PHY1CR_RETENABLEN1_Msk                                              /*!< Retention mode enable (active low) */
#define SYSCFG_USB2PHY1CR_AUTORSMENB1_Pos                                  (1U)
#define SYSCFG_USB2PHY1CR_AUTORSMENB1_Msk                                  (0x1UL << SYSCFG_USB2PHY1CR_AUTORSMENB1_Pos)                                    /*!< 0x00000002 */
#define SYSCFG_USB2PHY1CR_AUTORSMENB1                                      SYSCFG_USB2PHY1CR_AUTORSMENB1_Msk                                              /*!< Auto-resume mode enable */
#define SYSCFG_USB2PHY1CR_USB2PHY1CMN_Pos                                  (2U)
#define SYSCFG_USB2PHY1CR_USB2PHY1CMN_Msk                                  (0x1UL << SYSCFG_USB2PHY1CR_USB2PHY1CMN_Pos)                                    /*!< 0x00000004 */
#define SYSCFG_USB2PHY1CR_USB2PHY1CMN                                      SYSCFG_USB2PHY1CR_USB2PHY1CMN_Msk                                              /*!< Controls the power down of analog blocks during Suspend and Sleep */
#define SYSCFG_USB2PHY1CR_USB2PHY1SEL_Pos                                  (4U)
#define SYSCFG_USB2PHY1CR_USB2PHY1SEL_Msk                                  (0x7UL << SYSCFG_USB2PHY1CR_USB2PHY1SEL_Pos)                                    /*!< 0x00000070 */
#define SYSCFG_USB2PHY1CR_USB2PHY1SEL                                      SYSCFG_USB2PHY1CR_USB2PHY1SEL_Msk                                              /*!< PHY refclk speed setting: */

/*************  Bit definition for SYSCFG_USB2PHY1BCCR register  **************/
#define SYSCFG_USB2PHY1BCCR_H_CDPEN_Pos                                    (0U)
#define SYSCFG_USB2PHY1BCCR_H_CDPEN_Msk                                    (0x1UL << SYSCFG_USB2PHY1BCCR_H_CDPEN_Pos)                                      /*!< 0x00000001 */
#define SYSCFG_USB2PHY1BCCR_H_CDPEN                                        SYSCFG_USB2PHY1BCCR_H_CDPEN_Msk                                                /*!< Enable CDP behavior for Host port */
#define SYSCFG_USB2PHY1BCCR_H_CDPDETEN_Pos                                 (1U)
#define SYSCFG_USB2PHY1BCCR_H_CDPDETEN_Msk                                 (0x1UL << SYSCFG_USB2PHY1BCCR_H_CDPDETEN_Pos)                                   /*!< 0x00000002 */
#define SYSCFG_USB2PHY1BCCR_H_CDPDETEN                                     SYSCFG_USB2PHY1BCCR_H_CDPDETEN_Msk                                             /*!< Enable of voltage detector on DP for CDP port */
#define SYSCFG_USB2PHY1BCCR_H_VDMSRCEN_Pos                                 (2U)
#define SYSCFG_USB2PHY1BCCR_H_VDMSRCEN_Msk                                 (0x1UL << SYSCFG_USB2PHY1BCCR_H_VDMSRCEN_Pos)                                   /*!< 0x00000004 */
#define SYSCFG_USB2PHY1BCCR_H_VDMSRCEN                                     SYSCFG_USB2PHY1BCCR_H_VDMSRCEN_Msk                                             /*!< Enable of voltage source on DM for CDP port */
#define SYSCFG_USB2PHY1BCCR_H_FORCEBCMODE_Pos                              (3U)
#define SYSCFG_USB2PHY1BCCR_H_FORCEBCMODE_Msk                              (0x1UL << SYSCFG_USB2PHY1BCCR_H_FORCEBCMODE_Pos)                                /*!< 0x00000008 */
#define SYSCFG_USB2PHY1BCCR_H_FORCEBCMODE                                  SYSCFG_USB2PHY1BCCR_H_FORCEBCMODE_Msk                                          /*!< Forces USB2PHY1 in non-driving, suspend mode */

/*************  Bit definition for SYSCFG_USB2PHY1BCSR register  **************/
#define SYSCFG_USB2PHY1BCSR_CHGDET_Pos                                     (0U)
#define SYSCFG_USB2PHY1BCSR_CHGDET_Msk                                     (0x1UL << SYSCFG_USB2PHY1BCSR_CHGDET_Pos)                                       /*!< 0x00000001 */
#define SYSCFG_USB2PHY1BCSR_CHGDET                                         SYSCFG_USB2PHY1BCSR_CHGDET_Msk                                                 /*!< Comparison of voltage on DP with VDAT_REF threshold as defined in BC v1 */
#define SYSCFG_USB2PHY1BCSR_FSVPLUS_Pos                                    (1U)
#define SYSCFG_USB2PHY1BCSR_FSVPLUS_Msk                                    (0x1UL << SYSCFG_USB2PHY1BCSR_FSVPLUS_Pos)                                      /*!< 0x00000002 */
#define SYSCFG_USB2PHY1BCSR_FSVPLUS                                        SYSCFG_USB2PHY1BCSR_FSVPLUS_Msk                                                /*!< Voltage level on DP (also output of the comparison with VLGC threshold as defined in BC v1 */
#define SYSCFG_USB2PHY1BCSR_FSVMINUS_Pos                                   (2U)
#define SYSCFG_USB2PHY1BCSR_FSVMINUS_Msk                                   (0x1UL << SYSCFG_USB2PHY1BCSR_FSVMINUS_Pos)                                     /*!< 0x00000004 */
#define SYSCFG_USB2PHY1BCSR_FSVMINUS                                       SYSCFG_USB2PHY1BCSR_FSVMINUS_Msk                                               /*!< voltage level on DM (also output of the comparison with VLGC threshold as defined in BC v1 */

/************  Bit definition for SYSCFG_USB2PHY1TRIM1CR register  ************/
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLITUNE_Pos                        (0U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLITUNE_Msk                        (0x3UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLITUNE_Pos)                          /*!< 0x00000003 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLITUNE                            SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLITUNE_Msk                                    /*!< PLL Integral Path Tune */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLPTUNE_Pos                        (2U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLPTUNE_Msk                        (0xFUL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLPTUNE_Pos)                          /*!< 0x0000003C */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLPTUNE                            SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLPTUNE_Msk                                    /*!< PLL Proportional Path Tune */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1COMPDISTUNE_Pos                     (6U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1COMPDISTUNE_Msk                     (0x7UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1COMPDISTUNE_Pos)                       /*!< 0x000001C0 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1COMPDISTUNE                         SYSCFG_USB2PHY1TRIM1CR_USB2PHY1COMPDISTUNE_Msk                                 /*!< Disconnect Threshold Adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1SQRXTUNE_Pos                        (9U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1SQRXTUNE_Msk                        (0x7UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1SQRXTUNE_Pos)                          /*!< 0x00000E00 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1SQRXTUNE                            SYSCFG_USB2PHY1TRIM1CR_USB2PHY1SQRXTUNE_Msk                                    /*!< Squelch Threshold Adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1VDATREFTUNE_Pos                     (12U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1VDATREFTUNE_Msk                     (0x3UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1VDATREFTUNE_Pos)                       /*!< 0x00003000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1VDATREFTUNE                         SYSCFG_USB2PHY1TRIM1CR_USB2PHY1VDATREFTUNE_Msk                                 /*!< Data Detect Voltage Adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1OTGTUNE_Pos                         (14U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1OTGTUNE_Msk                         (0x7UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1OTGTUNE_Pos)                           /*!< 0x0001C000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1OTGTUNE                             SYSCFG_USB2PHY1TRIM1CR_USB2PHY1OTGTUNE_Msk                                     /*!< VBUS Valid Threshold Adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXHSXVTUNE_Pos                      (17U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXHSXVTUNE_Msk                      (0x3UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXHSXVTUNE_Pos)                        /*!< 0x00060000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXHSXVTUNE                          SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXHSXVTUNE_Msk                                  /*!< Transmitter High Speed Crossover Adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXFSLSTUNE_Pos                      (19U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXFSLSTUNE_Msk                      (0xFUL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXFSLSTUNE_Pos)                        /*!< 0x00780000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXFSLSTUNE                          SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXFSLSTUNE_Msk                                  /*!< FS/LS Source Impedance Adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXVREFTUNE_Pos                      (23U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXVREFTUNE_Msk                      (0xFUL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXVREFTUNE_Pos)                        /*!< 0x07800000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXVREFTUNE                          SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXVREFTUNE_Msk                                  /*!< HS DC Voltage Level Adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRISETUNE_Pos                      (27U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRISETUNE_Msk                      (0x3UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRISETUNE_Pos)                        /*!< 0x18000000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRISETUNE                          SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRISETUNE_Msk                                  /*!< HS Transmitter Rise/Fall Time Adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRESTUNE_Pos                       (29U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRESTUNE_Msk                       (0x3UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRESTUNE_Pos)                         /*!< 0x60000000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRESTUNE                           SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRESTUNE_Msk                                   /*!< USB Source Impedance Adjustment */

/************  Bit definition for SYSCFG_USB2PHY1TRIM2CR register  ************/
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPAMPTUNE_Pos                 (0U)
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPAMPTUNE_Msk                 (0x3UL << SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPAMPTUNE_Pos)                   /*!< 0x00000003 */
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPAMPTUNE                     SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPAMPTUNE_Msk                             /*!< HS Transmitter Pre Emphasis Current Control */
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPPULSETUNE_Pos               (2U)
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPPULSETUNE_Msk               (0x1UL << SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPPULSETUNE_Pos)                 /*!< 0x00000004 */
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPPULSETUNE                   SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPPULSETUNE_Msk                           /*!< HS Transmitter Pre Emphasis Duration Control */

/****************  Bit definition for SYSCFG_USBHCR register  *****************/
#define SYSCFG_USBHCR_USBH_OVRCUR_POLARITY_Pos                             (0U)
#define SYSCFG_USBHCR_USBH_OVRCUR_POLARITY_Msk                             (0x1UL << SYSCFG_USBHCR_USBH_OVRCUR_POLARITY_Pos)                               /*!< 0x00000001 */
#define SYSCFG_USBHCR_USBH_OVRCUR_POLARITY                                 SYSCFG_USBHCR_USBH_OVRCUR_POLARITY_Msk                                         /*!< Polarity of USBH_OVRCUR alternate function: */
#define SYSCFG_USBHCR_USBH_VBUSEN_POLARITY_Pos                             (1U)
#define SYSCFG_USBHCR_USBH_VBUSEN_POLARITY_Msk                             (0x1UL << SYSCFG_USBHCR_USBH_VBUSEN_POLARITY_Pos)                               /*!< 0x00000002 */
#define SYSCFG_USBHCR_USBH_VBUSEN_POLARITY                                 SYSCFG_USBHCR_USBH_VBUSEN_POLARITY_Msk                                         /*!< Polarity of USBH_VBUSEN alternate function: */

