STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251fxx_ca35.h
/**************  Bit definition for USB3_LLUCTL register  **************/
#define USB3_LLUCTL_NO_UX_EXIT_P0_TRANS_Pos                           (5U)
#define USB3_LLUCTL_NO_UX_EXIT_P0_TRANS_Msk                           (0x1UL << USB3_LLUCTL_NO_UX_EXIT_P0_TRANS_Pos)              /*!< 0x00000020 */
#define USB3_LLUCTL_NO_UX_EXIT_P0_TRANS                               USB3_LLUCTL_NO_UX_EXIT_P0_TRANS_Msk                        /*!< no_ux_exit_p0_trans */
#define USB3_LLUCTL_MASK_PIPE_RESET_Pos                               (7U)
#define USB3_LLUCTL_MASK_PIPE_RESET_Msk                               (0x1UL << USB3_LLUCTL_MASK_PIPE_RESET_Pos)                  /*!< 0x00000080 */
#define USB3_LLUCTL_MASK_PIPE_RESET                                   USB3_LLUCTL_MASK_PIPE_RESET_Msk                            /*!< Mask pipe reset */
#define USB3_LLUCTL_EN_RESET_PIPE_AFTER_PHY_MUX_Pos                   (11U)
#define USB3_LLUCTL_EN_RESET_PIPE_AFTER_PHY_MUX_Msk                   (0x1UL << USB3_LLUCTL_EN_RESET_PIPE_AFTER_PHY_MUX_Pos)      /*!< 0x00000800 */
#define USB3_LLUCTL_EN_RESET_PIPE_AFTER_PHY_MUX                       USB3_LLUCTL_EN_RESET_PIPE_AFTER_PHY_MUX_Msk                /*!< en_reset_pipe_after_phy_mux */
#define USB3_LLUCTL_U2P3CPMOK_Pos                                     (12U)
#define USB3_LLUCTL_U2P3CPMOK_Msk                                     (0x1UL << USB3_LLUCTL_U2P3CPMOK_Pos)                        /*!< 0x00001000 */
#define USB3_LLUCTL_U2P3CPMOK                                         USB3_LLUCTL_U2P3CPMOK_Msk                                  /*!< P3CPM OK for U2/SSInactive (U2P3CPMok) */
#define USB3_LLUCTL_DISRXDET_LTSSM_TIMER_OVRRD_Pos                    (23U)
#define USB3_LLUCTL_DISRXDET_LTSSM_TIMER_OVRRD_Msk                    (0x1UL << USB3_LLUCTL_DISRXDET_LTSSM_TIMER_OVRRD_Pos)       /*!< 0x00800000 */
#define USB3_LLUCTL_DISRXDET_LTSSM_TIMER_OVRRD                        USB3_LLUCTL_DISRXDET_LTSSM_TIMER_OVRRD_Msk                 /*!< DisRxDet_LTSSM_Timer_Ovrrd */
#define USB3_LLUCTL_SUPPORT_P4_Pos                                    (28U)
#define USB3_LLUCTL_SUPPORT_P4_Msk                                    (0x1UL << USB3_LLUCTL_SUPPORT_P4_Pos)                       /*!< 0x10000000 */
#define USB3_LLUCTL_SUPPORT_P4                                        USB3_LLUCTL_SUPPORT_P4_Msk                                 /*!< Support PHY P3 */
#define USB3_LLUCTL_SUPPORT_P4_PG_Pos                                 (29U)
#define USB3_LLUCTL_SUPPORT_P4_PG_Msk                                 (0x1UL << USB3_LLUCTL_SUPPORT_P4_PG_Pos)                    /*!< 0x20000000 */
#define USB3_LLUCTL_SUPPORT_P4_PG                                     USB3_LLUCTL_SUPPORT_P4_PG_Msk                              /*!< PHY P4 power gate mode (PG) is enabled */

/***********  Bit definition for USB3_LPTMDPDELAY register  ************/
#define USB3_LPTMDPDELAY_P3CPMP4_RESIDENCY_Pos                        (10U)
#define USB3_LPTMDPDELAY_P3CPMP4_RESIDENCY_Msk                        (0xFFFUL << USB3_LPTMDPDELAY_P3CPMP4_RESIDENCY_Pos)         /*!< 0x003FFC00 */
#define USB3_LPTMDPDELAY_P3CPMP4_RESIDENCY                            USB3_LPTMDPDELAY_P3CPMP4_RESIDENCY_Msk                     /*!< p3cpmp4 residency timer value */


/******************************************************************************/
/*                                                                            */
/*                                 VREFBUF                                    */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for VREFBUF_CSR register  ****************/
#define VREFBUF_CSR_ENVR_Pos    (0U)
#define VREFBUF_CSR_ENVR_Msk    (0x1UL << VREFBUF_CSR_ENVR_Pos)                      /*!< 0x00000001 */
#define VREFBUF_CSR_ENVR        VREFBUF_CSR_ENVR_Msk                                /*!<Voltage reference buffer enable */
#define VREFBUF_CSR_HIZ_Pos     (1U)
#define VREFBUF_CSR_HIZ_Msk     (0x1UL << VREFBUF_CSR_HIZ_Pos)                       /*!< 0x00000002 */
#define VREFBUF_CSR_HIZ         VREFBUF_CSR_HIZ_Msk                                 /*!<High impedance mode             */
#define VREFBUF_CSR_VRS_Pos     (4U)
#define VREFBUF_CSR_VRS_Msk     (0x1UL << VREFBUF_CSR_VRS_Pos)                       /*!< 0x00000004 */
#define VREFBUF_CSR_VRS         VREFBUF_CSR_VRS_Msk                                 /*!<Voltage reference scale         */
#define VREFBUF_CSR_VRS_0       (0x01UL<< VREFBUF_CSR_VRS_Pos)                      /*!< 0x000O0010 */
#define VREFBUF_CSR_VRS_1       (0x02UL<< VREFBUF_CSR_VRS_Pos)                      /*!< 0x00000020 */
#define VREFBUF_CSR_VRS_2       (0x04UL<< VREFBUF_CSR_VRS_Pos)                      /*!< 0x00000030 */
#define VREFBUF_CSR_VRR_Pos     (3U)
#define VREFBUF_CSR_VRR_Msk     (0x1UL << VREFBUF_CSR_VRR_Pos)                       /*!< 0x00000008 */
#define VREFBUF_CSR_VRR         VREFBUF_CSR_VRR_Msk                                 /*!<Voltage reference buffer ready  */

/*******************  Bit definition for VREFBUF_CCR register  ******************/
#define VREFBUF_CCR_TRIM_Pos                (0U)
#define VREFBUF_CCR_TRIM_Msk                (0x3FUL << VREFBUF_CCR_TRIM_Pos)        /*!< 0x0000003F */
#define VREFBUF_CCR_TRIM                    VREFBUF_CCR_TRIM_Msk                    /*!<TRIM[5:0] bits (Trimming code)  */

/******************************************************************************/
/*                                                                            */
/*                           Window Watchdog (WWDG)                           */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for WWDG_CR register  ********************/
#define WWDG_CR_T_Pos           (0U)
#define WWDG_CR_T_Msk           (0x7FUL << WWDG_CR_T_Pos)          /*!< 0x0000007F */
#define WWDG_CR_T               WWDG_CR_T_Msk                     /*!< 7-bit counter (MSB to LSB) */
#define WWDG_CR_T_0             (0x1UL << WWDG_CR_T_Pos)           /*!< 0x00000001 */
#define WWDG_CR_T_1             (0x2UL << WWDG_CR_T_Pos)           /*!< 0x00000002 */
#define WWDG_CR_T_2             (0x4UL << WWDG_CR_T_Pos)           /*!< 0x00000004 */
#define WWDG_CR_T_3             (0x8UL << WWDG_CR_T_Pos)           /*!< 0x00000008 */
#define WWDG_CR_T_4             (0x10UL << WWDG_CR_T_Pos)          /*!< 0x00000010 */
#define WWDG_CR_T_5             (0x20UL << WWDG_CR_T_Pos)          /*!< 0x00000020 */
#define WWDG_CR_T_6             (0x40UL << WWDG_CR_T_Pos)          /*!< 0x00000040 */
#define WWDG_CR_WDGA_Pos        (7U)
#define WWDG_CR_WDGA_Msk        (0x1UL << WWDG_CR_WDGA_Pos)        /*!< 0x00000080 */
#define WWDG_CR_WDGA            WWDG_CR_WDGA_Msk                  /*!< Activation bit */

